drop table if exists Components;
create table Components
(
    components_id             int identity
        constraint Components_pk
            primary key nonclustered,
    project_id                int
        constraint FK_Components_project_id
            references Project,
    component_name            nvarchar(500),
    component_quantity        decimal(8, 2),
    component_unit            nvarchar(10),
    component_price           decimal(8, 2),
    component_document        nvarchar(100),
    component_document_number nvarchar(20),
    component_document_date   date,
    contractor_id             int
        constraint FK_Components_contractor_id
            references Contractors
);

insert into Components
(project_id, component_name, component_quantity,
 component_unit, component_price, component_document,
 component_document_number, component_document_date, contractor_id)
values (1087, N'Компактный компьютер Lanner NCA-1010 Intel Atom E3815/2 Gb DDR3L/ 2 Gb/ (HW50N1) L1010-01', 1, N'шт.',
        21743.75, N'УПД № Z0808230002 от 08.08.2023 г.', N'Z0808230002', '2023-08-08', 3),
       (1087, N'Этикетки полипропиленовые 100 х 52,8 мм', 2, N'шт.', 665.83, N'УПД № 01-02\000601 от 20.02.2023 г.',
        N'01-02\000601', '2023-02-20', 5),
       (1087, N'Наклейка (пломба)', 2, N'шт.', 13.89, N'УПД № 154 от 16.06.2023 г.', N'154', '2023-06-16', 6),
       (1087, N'Голографические наклейки', 1, N'шт.', 1.67, N'УПД № 14 от 19.03.2019 г.', N'14', '2019-03-19', 6),
       (1087, N'Диск ViPNet Coordinator HW 4 (4.5.2)', 1, N'шт.', 31.50, N'УПД № 259 от 24.07.2023 г.', N'259',
        '2023-07-24', 7),
       (1087, N'Этикетки полиппропиленовые 43х25 мм', 1, N'шт.', 331.67, N'УПД № 01-02\000601 от 20.02.2023 г.',
        N'01-02\000601', '2023-02-20', 5),
       (1088, N'Компактный компьютер Lanner NCA-1010 Intel Atom E3815/2 Gb DDR3L/ 2 Gb/ (HW50N1) L1010-01', 1, N'шт.',
        21743.75, N'УПД № Z0808230002 от 08.08.2023 г.', N'Z0808230002', '2023-08-08', 3),
       (1088, N'Модуль- WiFi для HW50/100', 1, N'шт.', 3895.90, N'УПД № Z1407230004 от 14.07.2023 г.', N'Z1407230004',
        '2023-07-14', 3),
       (1088, N'Этикетки полипропиленовые 100 х 52,8 мм', 2, N'шт.', 665.83, N'УПД № 01-02\000601 от 20.02.2023 г.',
        N'01-02\000601', '2023-02-20', 5),
       (1088, N'Наклейка (пломба)', 2, N'шт.', 13.89, N'УПД № 154 от 16.06.2023 г.', N'154', '2023-06-16', 6),
       (1088, N'Голографические наклейки', 1, N'шт.', 1.67, N'УПД № 14 от 19.03.2019 г.', N'14', '2019-03-19', 6),
       (1088, N'Диск ViPNet Coordinator HW 4 (4.5.2)', 1, N'шт.', 31.50, N'УПД № 259 от 24.07.2023 г.', N'259',
        '2023-07-24', 7),
       (1088, N'Этикетки полиппропиленовые 43х25 мм', 1, N'шт.', 331.67, N'УПД № 01-02\000601 от 20.02.2023 г.',
        N'01-02\000601', '2023-02-20', 5),
       (63, N'Компактный компьютер Lanner NCA-1010 Intel Atom E3815/2 Gb DDR3L/ 2 Gb/ (HW50N1) L1010-01', 1, N'шт.',
        21743.75, N'УПД № Z0808230002 от 08.08.2023 г.', N'Z0808230002', '2023-08-08', 3),
       (63, N'Модуль 3G MINI-PCIE 0TAW0ZU202Z01 LANNER', 1, N'шт.', 11621.88, N'УПД № Z2508230001 от 25.08.2023 г.',
        N'Z2508230001', '2023-08-25', 3),
       (63, N'Аксессуар для платы ANTENNA 3G 0TZ0Q000000072 LANNER', 1, N'шт.', 404.91,
        N'УПД № Z1407230003 от 14.07.2023 г.', N'Z1407230003', '2023-07-14', 3),
       (63, N'Кабель антенный 3G/GPS 080W0Q0001001 Lanner Electronics', 1, N'шт.', 422.06,
        N'УПД № Z1407230004 от 14.07.2023 г.', N'Z1407230004', '2023-07-14', 3),
       (63, N'Этикетки полипропиленовые 100 х 52,8 мм', 2, N'шт.', 665.83, N'УПД № 01-02\000601 от 20.02.2023 г.',
        N'01-02\000601', '2023-02-20', 5),
       (63, N'Наклейка (пломба)', 2, N'шт.', 13.89, N'УПД № 154 от 16.06.2023 г.', N'154', '2023-06-16', 6),
       (63, N'Голографические наклейки', 1, N'шт.', 1.67, N'УПД № 14 от 19.03.2019 г.', N'14', '2019-03-19', 6),
       (63, N'Диск ViPNet Coordinator HW 4 (4.5.2)', 1, N'шт.', 31.50, N'УПД № 259 от 24.07.2023 г.', N'259',
        '2023-07-24', 7),
       (63, N'Этикетки полиппропиленовые 43х25 мм', 1, N'шт.', 331.67, N'УПД № 01-02\000601 от 20.02.2023 г.',
        N'01-02\000601', '2023-02-20', 5),
       (1089,
        N'Безвентиляторный компьютер Lanner LEC-6032-IT2 ATOM-2807 4XGBE DIM/ 2GB DDR3/SSD2Gb/500 GB  (HW100N1) L6032-01',
        1, N'шт.', 54691.52, N'УПД № Z2209230002 от 22.09.2023 г.', N'Z2209230002', '2023-09-22', 3),
       (1089, N'Этикетки полипропиленовые 100 х 52,8 мм', 2, N'шт.', 665.83, N'УПД № 01-02\000601 от 20.02.2023 г.',
        N'01-02\000601', '2023-02-20', 5),
       (1089, N'Наклейка (пломба)', 2, N'шт.', 13.89, N'УПД № 154 от 16.06.2023 г.', N'154', '2023-06-16', 6),
       (1089, N'Голографические наклейки', 1, N'шт.', 1.67, N'УПД № 14 от 19.03.2019 г.', N'14', '2019-03-19', 6),
       (1089, N'Диск ViPNet Coordinator HW 4 (4.5.2)', 1, N'шт.', 31.50, N'УПД № 259 от 24.07.2023 г.', N'259',
        '2023-07-24', 7),
       (1089, N'Этикетки полиппропиленовые 43х25 мм', 1, N'шт.', 331.67, N'УПД № 01-02\000601 от 20.02.2023 г.',
        N'01-02\000601', '2023-02-20', 5),
       (73,
        N'Безвентиляторный компьютер Lanner LEC-6032-IT2 ATOM-2807 4XGBE DIM/ 2GB DDR3/SSD2Gb/500 GB  (HW100N1) L6032-01',
        1, N'шт.', 54691.52, N'УПД № Z2209230002 от 22.09.2023 г.', N'Z2209230002', '2023-09-22', 3),
       (73, N'Модуль- WiFi для HW50/100', 1, N'шт.', 3895.90, N'УПД № Z1407230004 от 14.07.2023 г.', N'Z1407230004',
        '2023-07-14', 3),
       (73, N'Этикетки полипропиленовые 100 х 52,8 мм', 2, N'шт.', 665.83, N'УПД № 01-02\000601 от 20.02.2023 г.',
        N'01-02\000601', '2023-02-20', 5),
       (73, N'Наклейка (пломба)', 2, N'шт.', 13.89, N'УПД № 154 от 16.06.2023 г.', N'154', '2023-06-16', 6),
       (73, N'Голографические наклейки', 1, N'шт.', 1.67, N'УПД № 14 от 19.03.2019 г.', N'14', '2019-03-19', 6),
       (73, N'Диск ViPNet Coordinator HW 4 (4.5.2)', 1, N'шт.', 31.50, N'УПД № 259 от 24.07.2023 г.', N'259',
        '2023-07-24', 7),
       (73, N'Этикетки полиппропиленовые 43х25 мм', 1, N'шт.', 331.67, N'УПД № 01-02\000601 от 20.02.2023 г.',
        N'01-02\000601', '2023-02-20', 5),
       (77,
        N'Безвентиляторный компьютер Lanner LEC-6032-IT2 ATOM-2807 4XGBE DIM/ 2GB DDR3/SSD2Gb/500 GB  (HW100N1) L6032-01',
        1, N'шт.', 54691.52, N'УПД № Z2209230002 от 22.09.2023 г.', N'Z2209230002', '2023-09-22', 3),
       (77, N'Модуль 3G MINI-PCIE 0TAW0ZU202Z01 LANNER', 1, N'шт.', 11621.88, N'УПД № Z2508230001 от 25.08.2023 г.',
        N'Z2508230001', '2023-08-25', 3),
       (77, N'Аксессуар для платы ANTENNA 3G 0TZ0Q000000072 LANNER', 1, N'шт.', 404.91,
        N'УПД № Z1407230003 от 14.07.2023 г.', N'Z1407230003', '2023-07-14', 3),
       (77, N'Кабель антенный 3G/GPS 080W0Q0001001 Lanner Electronics', 1, N'шт.', 422.06,
        N'УПД № Z1407230004 от 14.07.2023 г.', N'Z1407230004', '2023-07-14', 3),
       (77, N'Этикетки полипропиленовые 100 х 52,8 мм', 2, N'шт.', 665.83, N'УПД № 01-02\000601 от 20.02.2023 г.',
        N'01-02\000601', '2023-02-20', 5),
       (77, N'Наклейка (пломба)', 2, N'шт.', 13.89, N'УПД № 154 от 16.06.2023 г.', N'154', '2023-06-16', 6),
       (77, N'Голографические наклейки', 1, N'шт.', 1.67, N'УПД № 14 от 19.03.2019 г.', N'14', '2019-03-19', 6),
       (77, N'Диск ViPNet Coordinator HW 4 (4.5.2)', 1, N'шт.', 31.50, N'УПД № 259 от 24.07.2023 г.', N'259',
        '2023-07-24', 7),
       (77, N'Этикетки полиппропиленовые 43х25 мм', 1, N'шт.', 331.67, N'УПД № 01-02\000601 от 20.02.2023 г.',
        N'01-02\000601', '2023-02-20', 5),
       (1068, N'Сервер Аквариус T41 S102DF-V R51  (HW1000Q7, TLS500Q2) T41S102-01', 1, N'шт.', 143665.39,
        N'УПД № Z0510230002 от 05.10.2023 г.', N'Z0510230002', '2023-10-05', 3),
       (1068, N'Этикетки полипропиленовые 100 х 52,8 мм', 2, N'шт.', 665.83, N'УПД № 01-02\000601 от 20.02.2023 г.',
        N'01-02\000601', '2023-02-20', 5),
       (1068, N'Наклейка (пломба)', 2, N'шт.', 13.89, N'УПД № 154 от 16.06.2023 г.', N'154', '2023-06-16', 6),
       (1068, N'Голографические наклейки', 1, N'шт.', 1.67, N'УПД № 14 от 19.03.2019 г.', N'14', '2019-03-19', 6),
       (1068, N'Диск ViPNet Coordinator HW 4 (4.5.2)', 1, N'шт.', 31.50, N'УПД № 259 от 24.07.2023 г.', N'259',
        '2023-07-24', 7),
       (1068, N'Этикетки полиппропиленовые 43х25 мм', 1, N'шт.', 331.67, N'УПД № 01-02\000601 от 20.02.2023 г.',
        N'01-02\000601', '2023-02-20', 5),
       (1069, N'Сервер Аквариус T41 S102DF-V R52  (HW1000Q8,  xF1000 Q7, IDS NS1000 Q3) T41S102-02', 1, N'шт.',
        183599.62, N'УПД № Z0510230002 от 05.10.2023 г.', N'Z0510230002', '2023-10-05', 3),
       (1069, N'Этикетки полипропиленовые 100 х 52,8 мм', 2, N'шт.', 665.83, N'УПД № 01-02\000601 от 20.02.2023 г.',
        N'01-02\000601', '2023-02-20', 5),
       (1069, N'Наклейка (пломба)', 2, N'шт.', 13.89, N'УПД № 154 от 16.06.2023 г.', N'154', '2023-06-16', 6),
       (1069, N'Голографические наклейки', 1, N'шт.', 1.67, N'УПД № 14 от 19.03.2019 г.', N'14', '2019-03-19', 6),
       (1069, N'Диск ViPNet Coordinator HW 4 (4.5.2)', 1, N'шт.', 31.50, N'УПД № 259 от 24.07.2023 г.', N'259',
        '2023-07-24', 7),
       (1069, N'Этикетки полиппропиленовые 43х25 мм', 1, N'шт.', 331.67, N'УПД № 01-02\000601 от 20.02.2023 г.',
        N'01-02\000601', '2023-02-20', 5),
       (1090, N'Сервер Аквариус T41 S102DF-V R53  (HW1000 Q9, xF1000 Q8,  TLS1000 Q3) T41S102-03', 1, N'шт.', 237293.69,
        N'УПД № Z1210230001 от 12.10.2023 г.', N'Z1210230001', '2023-10-12', 3),
       (1090, N'Этикетки полипропиленовые 100 х 52,8 мм', 2, N'шт.', 665.83, N'УПД № 01-02\000601 от 20.02.2023 г.',
        N'01-02\000601', '2023-02-20', 5),
       (1090, N'Наклейка (пломба)', 2, N'шт.', 13.89, N'УПД № 154 от 16.06.2023 г.', N'154', '2023-06-16', 6),
       (1090, N'Голографические наклейки', 1, N'шт.', 1.67, N'УПД № 14 от 19.03.2019 г.', N'14', '2019-03-19', 6),
       (1090, N'Диск ViPNet Coordinator HW 4 (4.5.2)', 1, N'шт.', 31.50, N'УПД № 259 от 24.07.2023 г.', N'259',
        '2023-07-24', 7),
       (1090, N'Этикетки полиппропиленовые 43х25 мм', 1, N'шт.', 331.67, N'УПД № 01-02\000601 от 20.02.2023 г.',
        N'01-02\000601', '2023-02-20', 5),
       (1091, N'Сервер Аквариус T41 S102DF-V R50 (V06) (HW 2000 Q5)', 1, N'шт.', 356932.87,
        N'УПД № Z0510230002 от 05.10.2023 г.', N'Z0510230002', '2023-10-05', 3),
       (1091, N'Этикетки полипропиленовые 100 х 52,8 мм', 2, N'шт.', 665.83, N'УПД № 01-02\000601 от 20.02.2023 г.',
        N'01-02\000601', '2023-02-20', 5),
       (1091, N'Наклейка (пломба)', 2, N'шт.', 13.89, N'УПД № 154 от 16.06.2023 г.', N'154', '2023-06-16', 6),
       (1091, N'Голографические наклейки', 1, N'шт.', 1.67, N'УПД № 14 от 19.03.2019 г.', N'14', '2019-03-19', 6),
       (1091, N'Диск ViPNet Coordinator HW 4 (4.5.2)', 1, N'шт.', 31.50, N'УПД № 259 от 24.07.2023 г.', N'259',
        '2023-07-24', 7),
       (1091, N'Этикетки полиппропиленовые 43х25 мм', 1, N'шт.', 331.67, N'УПД № 01-02\000601 от 20.02.2023 г.',
        N'01-02\000601', '2023-02-20', 5),
       (1092, N'Сервер Аквариус T41 S102DF-V R55  (HW5000 Q2, xF5000 Q2, TLS5000 Q2, IDS NS10000 Q1) T41S102-05', 1,
        N'шт.', 376345.00, N'УПД № Z0510230002 от 05.10.2023 г.', N'Z0510230002', '2023-10-05', 3),
       (1092, N'Этикетки полипропиленовые 100 х 52,8 мм', 2, N'шт.', 665.83, N'УПД № 01-02\000601 от 20.02.2023 г.',
        N'01-02\000601', '2023-02-20', 5),
       (1092, N'Наклейка (пломба)', 2, N'шт.', 13.89, N'УПД № 154 от 16.06.2023 г.', N'154', '2023-06-16', 6),
       (1092, N'Голографические наклейки', 1, N'шт.', 1.67, N'УПД № 14 от 19.03.2019 г.', N'14', '2019-03-19', 6),
       (1092, N'Диск ViPNet Coordinator HW 4 (4.5.2)', 1, N'шт.', 31.50, N'УПД № 259 от 24.07.2023 г.', N'259',
        '2023-07-24', 7),
       (1092, N'Этикетки полиппропиленовые 43х25 мм', 1, N'шт.', 331.67, N'УПД № 01-02\000601 от 20.02.2023 г.',
        N'01-02\000601', '2023-02-20', 5),
       (1093, N'Безвентиляторный компьютер Lanner LEC-6032-IT3  (КВ 100N1) L6032-03', 1, N'шт.', 56275.07,
        N'УПД № Z1407230004 от 14.07.2023 г.', N'Z1407230004', '2023-07-14', 3),
       (1093, N'Блок электронный ФРКЕ.468989.002 Комплекс ДНСД (ТКС0008_1)', 1, N'шт.', 4446.92,
        N'УПД № ВС000000066 от 09.06.2020 г.', N'ВС000000066', '2020-06-09', 4),
       (1093, N'Внешний привод DVD-RW Lite-On eBAU108 USB slim ext M-disk RTL', 1, N'шт.', 1191.67,
        N'УПД № 20-00197-2 от 04.03.2020 г.', N'20-00197-2', '2020-03-04', 2),
       (1093, N'Рутокен ЭЦП 2,0 128 Кб Flash 4Gb/8Gb', 1, N'шт.', 2593.14, N'УПД № УП-1154 от 09.04.2020 г.',
        N'УП-1154', '2020-04-09', 1),
       (1093, N'Концентратор USB 2.0 Orient CU-210N на 4 порта', 1, N'шт.', 201.25,
        N'УПД № Z2904200001 от 29.04.2020 г.', N'Z2904200001', '2020-04-29', 3),
       (1093, N'Трансивер Avago AFBR-5710PZ', 1, N'шт.', 5048.15, N'УПД № Z2208230002 от 22.08.2023 г.', N'Z2208230002',
        '2023-08-22', 3),
       (1093, N'Этикетки полипропиленовые 100 х 52,8 мм', 2, N'шт.', 665.83, N'УПД № 01-02\000601 от 20.02.2023 г.',
        N'01-02\000601', '2023-02-20', 5),
       (1093, N'Наклейка (пломба)', 2, N'шт.', 13.89, N'УПД № 154 от 16.06.2023 г.', N'154', '2023-06-16', 6),
       (1093, N'Голографические наклейки', 1, N'шт.', 1.67, N'УПД № 14 от 19.03.2019 г.', N'14', '2019-03-19', 6),
       (1093, N'Диск ViPNet Coordinator HW 4 (4.5.2)', 1, N'шт.', 31.50, N'УПД № 259 от 24.07.2023 г.', N'259',
        '2023-07-24', 7),
       (1093, N'Этикетки полиппропиленовые 43х25 мм', 1, N'шт.', 331.67, N'УПД № 01-02\000601 от 20.02.2023 г.',
        N'01-02\000601', '2023-02-20', 5),
       (1094, N'Сервер-телеком Aquarius Server T41 S102DF-V R56 (KB1000Q8)', 1, N'шт.', 266055.05,
        N'УПД № Z1509230001 от 15.09.2023 г.', N'Z1509230001', '2023-09-15', 3),
       (1094, N'Блок электронный ФРКЕ.468989.002 Комплекс ДНСД (ТКС0008_1)', 1, N'шт.', 4446.92,
        N'УПД № ВС000000066 от 09.06.2020 г.', N'ВС000000066', '2020-06-09', 4),
       (1094, N'Внешний привод DVD-RW Lite-On eBAU108 USB slim ext M-disk RTL', 1, N'шт.', 1191.67,
        N'УПД № 20-00197-2 от 04.03.2020 г.', N'20-00197-2', '2020-03-04', 2),
       (1094, N'Рутокен ЭЦП 2,0 128 Кб Flash 4Gb/8Gb', 1, N'шт.', 2593.14, N'УПД № УП-1154 от 09.04.2020 г.',
        N'УП-1154', '2020-04-09', 1),
       (1094, N'Этикетки полипропиленовые 100 х 52,8 мм', 2, N'шт.', 665.83, N'УПД № 01-02\000601 от 20.02.2023 г.',
        N'01-02\000601', '2023-02-20', 5),
       (1094, N'Наклейка (пломба)', 2, N'шт.', 13.89, N'УПД № 154 от 16.06.2023 г.', N'154', '2023-06-16', 6),
       (1094, N'Голографические наклейки', 1, N'шт.', 1.67, N'УПД № 14 от 19.03.2019 г.', N'14', '2019-03-19', 6),
       (1094, N'Диск ViPNet Coordinator HW 4 (4.5.2)', 1, N'шт.', 31.50, N'УПД № 259 от 24.07.2023 г.', N'259',
        '2023-07-24', 7),
       (1094, N'Этикетки полиппропиленовые 43х25 мм', 1, N'шт.', 331.67, N'УПД № 01-02\000601 от 20.02.2023 г.',
        N'01-02\000601', '2023-02-20', 5),
       (1095, N'Сервер Аквариус T41 S102DF-V R50 (V08) (KB2000 Q5)', 1, N'шт.', 399022.24,
        N'УПД № Z0109230001 от 01.09.2023 г.', N'Z0109230001', '2023-09-01', 3),
       (1095, N'Блок электронный ФРКЕ.468989.002 Комплекс ДНСД (ТКС0008_1)', 1, N'шт.', 4446.92,
        N'УПД № ВС000000066 от 09.06.2020 г.', N'ВС000000066', '2020-06-09', 4),
       (1095, N'Внешний привод DVD-RW Lite-On eBAU108 USB slim ext M-disk RTL', 1, N'шт.', 1191.67,
        N'УПД № 20-00197-2 от 04.03.2020 г.', N'20-00197-2', '2020-03-04', 2),
       (1095, N'Рутокен ЭЦП 2,0 128 Кб Flash 4Gb/8Gb', 1, N'шт.', 2593.14, N'УПД № УП-1154 от 09.04.2020 г.',
        N'УП-1154', '2020-04-09', 1),
       (1095, N'Этикетки полипропиленовые 100 х 52,8 мм', 2, N'шт.', 665.83, N'УПД № 01-02\000601 от 20.02.2023 г.',
        N'01-02\000601', '2023-02-20', 5),
       (1095, N'Наклейка (пломба)', 2, N'шт.', 13.89, N'УПД № 154 от 16.06.2023 г.', N'154', '2023-06-16', 6),
       (1095, N'Голографические наклейки', 1, N'шт.', 1.67, N'УПД № 14 от 19.03.2019 г.', N'14', '2019-03-19', 6),
       (1095, N'Диск ViPNet Coordinator HW 4 (4.5.2)', 1, N'шт.', 31.50, N'УПД № 259 от 24.07.2023 г.', N'259',
        '2023-07-24', 7),
       (1095, N'Этикетки полиппропиленовые 43х25 мм', 1, N'шт.', 331.67, N'УПД № 01-02\000601 от 20.02.2023 г.',
        N'01-02\000601', '2023-02-20', 5),
       (1096, N'Сервер Аквариус T41 S102DF-V R50 (V07) (KB5000 Q2)', 1, N'шт.', 362719.17,
        N'УПД № Z1210230001 от 12.10.2023 г.', N'Z1210230001', '2023-10-12', 3),
       (1096, N'Блок электронный ФРКЕ.468989.002 Комплекс ДНСД (ТКС0008_1)', 1, N'шт.', 4446.92,
        N'УПД № ВС000000066 от 09.06.2020 г.', N'ВС000000066', '2020-06-09', 4),
       (1096, N'Внешний привод DVD-RW Lite-On eBAU108 USB slim ext M-disk RTL', 1, N'шт.', 1191.67,
        N'УПД № 20-00197-2 от 04.03.2020 г.', N'20-00197-2', '2020-03-04', 2),
       (1096, N'Рутокен ЭЦП 2,0 128 Кб Flash 4Gb/8Gb', 1, N'шт.', 2593.14, N'УПД № УП-1154 от 09.04.2020 г.',
        N'УП-1154', '2020-04-09', 1),
       (1096, N'Этикетки полипропиленовые 100 х 52,8 мм', 2, N'шт.', 665.83, N'УПД № 01-02\000601 от 20.02.2023 г.',
        N'01-02\000601', '2023-02-20', 5),
       (1096, N'Наклейка (пломба)', 2, N'шт.', 13.89, N'УПД № 154 от 16.06.2023 г.', N'154', '2023-06-16', 6),
       (1096, N'Голографические наклейки', 1, N'шт.', 1.67, N'УПД № 14 от 19.03.2019 г.', N'14', '2019-03-19', 6),
       (1096, N'Диск ViPNet Coordinator HW 4 (4.5.2)', 1, N'шт.', 31.50, N'УПД № 259 от 24.07.2023 г.', N'259',
        '2023-07-24', 7),
       (1096, N'Этикетки полиппропиленовые 43х25 мм', 1, N'шт.', 331.67, N'УПД № 01-02\000601 от 20.02.2023 г.',
        N'01-02\000601', '2023-02-20', 5);

select *
from Components;

select component_name,
       component_unit,
       component_quantity,
       component_price,
       component_document,
       contractor_full_name,
       contractor_inn
from Components
         inner join Contractors C on Components.contractor_id = C.contractor_id
         inner join Project P on Components.project_id = P.project_id
where project_cipher like
      N'Программно-аппаратный комплекс ViPNet Coordinator HW50 A 4.x (+3G)(+unlim%';

drop procedure if exists ComponentsRefresh;
create procedure ComponentsRefresh @code_1C as nvarchar(11)
as
begin
    --prevent the "1 row affected" message from being returned for every operation
    set nocount on
--statement for the procedure
    select component_name,
           component_unit,
           component_quantity,
           component_price,
           component_document,
           contractor_full_name,
           contractor_inn
    from Components
             inner join Contractors C on Components.contractor_id = C.contractor_id
             inner join Project P on Components.project_id = P.project_id
    where [1C_kod_project] =
              --'Программно-аппаратный комплекс ViPNet Coordinator HW50 A 4.x (+3G)(+unlim%';
          @code_1C;
end
go

exec ComponentsRefresh N'Программно-аппаратный комплекс ViPNet Coordinator HW100 C 4.x (+unlim%';


update Components
set component_price = 368947.33
where components_id = 11;

exec sp_rename 'PK__Componen__82E2D349A75C5B12', PK_Components_components_id, 'OBJECT';

exec sp_rename 'FK__Component__contr__214BF109', FK_Components_contractor_id, 'OBJECT';

exec sp_rename 'FK__Component__genui__22401542', FK_Components_project_id, 'OBJECT';

exec sp_rename 'Components.genuine_project_id', project_id, 'COLUMN';

alter table Components
    drop constraint FK_Components_project_id;

alter table Components
    add constraint FK_Components_project_id
        foreign key (project_id) references Project (project_id);
