insert into Other_General_Expenses(general_expenses_name)
values ('Амортизация арендованных помещений'),
       ('Амортизация программного обеспечения'),
       ('Аренда помещения и коммунальные услуги'),
       ('Информационная безопасность'),
       ('Канцтовары'),
       ('Лизинг оборудования'),
       ('Литература, подписка'),
       ('Лицензионные затраты'),
       ('Материалы'),
       ('НДС за счет собственных средств'),
       ('Неисключительное право на ПО'),
       ('Нотариальные, юридические, аудиторские услуги'),
       ('Оборудование для спецпроектов'),
       ('Офисные расходы'),
       ('Парковка'),
       ('Перевод документов для внутренних нужд'),
       ('Поддержка ПО'),
       ('Почта и курьерские услуги '),
       ('Прочие расходы'),
       ('Сервисные сборы'),
       ('Сертификация'),
       ('Создание ОС, НМА и НИОКР'),
       ('Списание НИОКР'),
       ('Страхование'),
       ('Транспортные расходы'),
       ('Услуги связи');


select *
from Other_General_Expenses;